PRIVATE VLAN CONFIGUR CMD'S
COMMUNITY VLAN , ISOLATED VLAN 
-------------------------------

SWITCH
--------

IOU2(config)#
IOU2(config)#
IOU2(config)#do sh vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 :
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : aabb.cc80.0200
Configuration last modified by 0.0.0.0 at 0-0-00 00:00:00
Local updater ID is 0.0.0.0 (no valid interface found)

Feature VLAN:
--------------
VTP Operating Mode                : Server
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 5
Configuration Revision            : 0
MD5 digest                        : 0x57 0xCD 0x40 0x65 0x63 0x59 0x47 0xBD
                                    0x56 0x9D 0x4A 0x3E 0xA5 0x69 0x35 0xBC
IOU2(config)#
*Aug 24 16:32:18.783: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config)#
*Aug 24 16:32:25.659: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
*Aug 24 16:32:26.635: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config)#
IOU2(config)#
IOU2(config)#vlan 10
*Aug 24 16:33:18.097: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config)#do sh vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 :
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : aabb.cc80.0200
Configuration last modified by 0.0.0.0 at 0-0-00 00:00:00
Local updater ID is 0.0.0.0 (no valid interface found)

Feature VLAN:
--------------
VTP Operating Mode                : Server
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 5
Configuration Revision            : 0
MD5 digest                        : 0x57 0xCD 0x40 0x65 0x63 0x59 0x47 0xBD
                                    0x56 0x9D 0x4A 0x3E 0xA5 0x69 0x35 0xBC
IOU2(config)#vtp mode tra
IOU2(config)#vtp mode transparent
Setting device to VTP Transparent mode for VLANS.
IOU2(config)#do sh vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 :
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : aabb.cc80.0200
Configuration last modified by 0.0.0.0 at 0-0-00 00:00:00

Feature VLAN:
--------------
VTP Operating Mode                : Transparent
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 5
Configuration Revision            : 0
MD5 digest                        : 0x57 0xCD 0x40 0x65 0x63 0x59 0x47 0xBD
                                    0x56 0x9D 0x4A 0x3E 0xA5 0x69 0x35 0xBC
IOU2(config)#
IOU2(config)#
IOU2(config)#vlan 10
IOU2(config-vlan)#pri
IOU2(config-vlan)#private-vlan pri
IOU2(config-vlan)#private-vlan primary
IOU2(config-vlan)#ex
IOU2(config)#
IOU2(config)#vlan 2
*Aug 24 16:34:16.142: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config)#vlan 20
IOU2(config-vlan)#pri
IOU2(config-vlan)#private-vlan comm
IOU2(config-vlan)#private-vlan community
IOU2(config-vlan)#ex
IOU2(config)#vla
IOU2(config)#vlan 30
IOU2(config-vlan)#pri
IOU2(config-vlan)#private-vlan comm
IOU2(config-vlan)#private-vlan comm
IOU2(config-vlan)#private-vlan community
IOU2(config-vlan)#ex
IOU2(config)#vlan 40
IOU2(config-vlan)#pri
IOU2(config-vlan)#private-vlan isol
IOU2(config-vlan)#private-vlan isolated
*Aug 24 16:35:04.326: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config-vlan)#private-vlan isolated
IOU2(config-vlan)#ex
IOU2(config)#
IOU2(config)#
IOU2(config)#vlan 10
IOU2(config-vlan)#pri
IOU2(config-vlan)#private-vlan ass
IOU2(config-vlan)#private-vlan association
IOU2(config-vlan)#private-vlan association add 20,3
*Aug 24 16:35:59.490: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config-vlan)#private-vlan association add 20,30,40
IOU2(config-vlan)#ex
IOU2(config)#
IOU2(config)#
IOU2(config)#int range e0/0-3,e1/0-1
IOU2(config-if-range)#sw
IOU2(config-if-range)#switchport mode
*Aug 24 16:36:51.490: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config-if-range)#switchport mode
IOU2(config-if-range)#switchport mode ac
IOU2(config-if-range)#switchport mode access
IOU2(config-if-range)#sw
IOU2(config-if-range)#switchport acc
IOU2(config-if-range)#switchport access vl
IOU2(config-if-range)#switchport access vlan 10
IOU2(config-if-range)#ex
IOU2(config)#
IOU2(config)#
IOU2(config)#int ran
IOU2(config)#int range e0/0-1
IOU2(config-if-range)#
*Aug 24 16:37:41.227: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config-if-range)#sw
IOU2(config-if-range)#switchport mo
IOU2(config-if-range)#switchport mode pr
IOU2(config-if-range)#switchport mode private-vlan host
IOU2(config-if-range)#switchport mode private-vlan host
IOU2(config-if-range)#sw
IOU2(config-if-range)#switchport
*Aug 24 16:37:55.280: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to down
*Aug 24 16:37:55.280: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, changed state to down
IOU2(config-if-range)#switchport pr
IOU2(config-if-range)#switchport prit\
IOU2(config-if-range)#switchport pri
IOU2(config-if-range)#switchport private-vlan host
IOU2(config-if-range)#switchport private-vlan host-association 10 20
IOU2(config-if-range)#ex
*Aug 24 16:38:17.595: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to up
*Aug 24 16:38:17.595: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, changed state to up
IOU2(config-if-range)#exit
IOU2(config)#
IOU2(config)#
IOU2(config)#int range
*Aug 24 16:38:31.324: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config)#int range e0/2-3
IOU2(config-if-range)#swi
IOU2(config-if-range)#switchport mo
IOU2(config-if-range)#switchport mode pri
IOU2(config-if-range)#switchport mode private-vlan host
IOU2(config-if-range)#switchport mode private-vlan host
IOU2(config-if-range)#s
*Aug 24 16:39:00.863: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/2, changed state to down
*Aug 24 16:39:00.863: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/3, changed state to down
IOU2(config-if-range)#sw
IOU2(config-if-range)#switchport pr
IOU2(config-if-range)#switchport pri
IOU2(config-if-range)#switchport private-vlan host
IOU2(config-if-range)#switchport private-vlan host-association 10 30
IOU2(config-if-range)#ex
*Aug 24 16:39:22.462: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/2, changed state to up
*Aug 24 16:39:22.463: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/3, changed state to up
IOU2(config-if-range)#ex
IOU2(config)#
*Aug 24 16:39:30.105: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config)#int e1/0
IOU2(config-if)#
IOU2(config-if)#
IOU2(config-if)#sw
IOU2(config-if)#switchport mo
IOU2(config-if)#switchport mode pri
IOU2(config-if)#switchport mode private-vlan host
IOU2(config-if)#switchport mode private-vlan host
IOU2(config-if)#sw
*Aug 24 16:39:57.058: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet1/0, changed state to down
IOU2(config-if)#swi
IOU2(config-if)#switchport pri
IOU2(config-if)#switchport private-vlan host ass
IOU2(config-if)#switchport private-vlan host asso
IOU2(config-if)#switchport private-vlan host
IOU2(config-if)#switchport private-vlan host-association 10 40
IOU2(config-if)#
*Aug 24 16:40:20.233: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config-if)#
*Aug 24 16:40:20.773: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet1/0, changed state to up
IOU2(config-if)#ex
IOU2(config)#
IOU2(config)#
IOU2(config)#int e1/1
IOU2(config-if)#
IOU2(config-if)#sw
IOU2(config-if)#switchport mod
IOU2(config-if)#switchport mode prt
IOU2(config-if)#switchport mode pri
IOU2(config-if)#switchport mode private-vlan pro
IOU2(config-if)#switchport mode private-vlan promiscuous
IOU2(config-if)#swi
IOU2(config-if)#switchport
*Aug 24 16:40:52.853: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet1/1, changed state to down
IOU2(config-if)#switchport pri
IOU2(config-if)#switchport private-vlan ma
*Aug 24 16:40:57.792: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet1/1, changed state to up
IOU2(config-if)#switchport private-vlan mapp
IOU2(config-if)#switchport private-vlan mapping 10 20,30,40
IOU2(config-if)#ex
IOU2(config)#
IOU2(config)#
IOU2(config)#
IOU2(config)#s
*Aug 24 16:41:18.005: %CDP-4-DUPLEX_MISMATCH: duplex mismatch discovered on Ethernet1/1 (not half duplex), with R1 FastEthernet0/0 (half duplex).
IOU2(config)#do sh vlan pr
IOU2(config)#do sh vlan private-vlan

Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------
10      20        community         Et0/0, Et0/1, Et1/1
10      30        community         Et0/2, Et0/3, Et1/1
10      40        isolated          Et1/0, Et1/1

IOU2(config)#do sh interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Et0/0                        connected    10,20      a-full   auto RJ45
Et0/1                        connected    10,20      a-full   auto RJ45
Et0/2                        connected    10,30      a-full   auto RJ45
Et0/3                        connected    10,30      a-full   auto RJ45
Et1/0                        connected    10,40      a-full   auto RJ45
Et1/1                        connected    10         a-full   auto RJ45
Et1/2                        connected    1          a-full   auto RJ45
Et1/3                        connected    1          a-full   auto RJ45
Et2/0                        connected    1          a-full   auto RJ45
Et2/1                        connected    1          a-full   auto RJ45
Et2/2                        connected    1          a-full   auto RJ45
Et2/3                        connected    1          a-full   auto RJ45
Et3/0                        connected    1          a-full   auto RJ45
Et3/1                        connected    1          a-full   auto RJ45
Et3/2                        connected    1          a-full   auto RJ45
Et3/3                        connected    1          a-full   auto RJ45
IOU2(config)#
--------------------------------------------------------------------------------------------------------------------------------------------

PC1
-------

PC1> ip 192.168.1.1/24 192.168.1.100
Checking for duplicate address...
PC1 : 192.168.1.1 255.255.255.0 gateway 192.168.1.100

PC1> sh ip

NAME        : PC1[1]
IP/MASK     : 192.168.1.1/24
GATEWAY     : 192.168.1.100
DNS         :
MAC         : 00:50:79:66:68:04
LPORT       : 20011
RHOST:PORT  : 127.0.0.1:20012
MTU         : 1500

PC1>
PC1>
PC1> ping 192.168.1.100

84 bytes from 192.168.1.100 icmp_seq=1 ttl=255 time=14.443 ms
84 bytes from 192.168.1.100 icmp_seq=2 ttl=255 time=4.502 ms
84 bytes from 192.168.1.100 icmp_seq=3 ttl=255 time=4.041 ms
84 bytes from 192.168.1.100 icmp_seq=4 ttl=255 time=4.637 ms
84 bytes from 192.168.1.100 icmp_seq=5 ttl=255 time=15.623 ms

PC1> ping 192.168.1.100

84 bytes from 192.168.1.100 icmp_seq=1 ttl=255 time=14.989 ms
84 bytes from 192.168.1.100 icmp_seq=2 ttl=255 time=8.966 ms
84 bytes from 192.168.1.100 icmp_seq=3 ttl=255 time=6.721 ms
84 bytes from 192.168.1.100 icmp_seq=4 ttl=255 time=4.888 ms
84 bytes from 192.168.1.100 icmp_seq=5 ttl=255 time=5.548 ms

PC1>
-------------------------------------------------------------------------------------------------------------------------------------------

PC2
--------

PC2> 192.168.1.2/24 192.168.1.100
Bad command: "192.168.1.2/24 192.168.1.100". Use ? for help.

PC2> ip 192.168.1.2/24 192.168.1.100
Checking for duplicate address...
PC2 : 192.168.1.2 255.255.255.0 gateway 192.168.1.100

PC2> sh ip

NAME        : PC2[1]
IP/MASK     : 192.168.1.2/24
GATEWAY     : 192.168.1.100
DNS         :
MAC         : 00:50:79:66:68:03
LPORT       : 20013
RHOST:PORT  : 127.0.0.1:20014
MTU         : 1500

PC2> ping 192.168.1.100

84 bytes from 192.168.1.100 icmp_seq=1 ttl=255 time=13.955 ms
84 bytes from 192.168.1.100 icmp_seq=2 ttl=255 time=6.708 ms
84 bytes from 192.168.1.100 icmp_seq=3 ttl=255 time=5.632 ms
84 bytes from 192.168.1.100 icmp_seq=4 ttl=255 time=5.884 ms
84 bytes from 192.168.1.100 icmp_seq=5 ttl=255 time=16.844 ms

PC2> ping 192.168.1.100

84 bytes from 192.168.1.100 icmp_seq=1 ttl=255 time=9.169 ms
84 bytes from 192.168.1.100 icmp_seq=2 ttl=255 time=3.815 ms
84 bytes from 192.168.1.100 icmp_seq=3 ttl=255 time=17.779 ms
84 bytes from 192.168.1.100 icmp_seq=4 ttl=255 time=2.931 ms
84 bytes from 192.168.1.100 icmp_seq=5 ttl=255 time=6.486 ms

PC2>
--------------------------------------------------------------------------------------------------------------------------------------------

PC3
------

PC3> ip 192.168.1.3/24 192.168.1.100
Checking for duplicate address...
PC3 : 192.168.1.3 255.255.255.0 gateway 192.168.1.100

PC3> sh ip

NAME        : PC3[1]
IP/MASK     : 192.168.1.3/24
GATEWAY     : 192.168.1.100
DNS         :
MAC         : 00:50:79:66:68:02
LPORT       : 20015
RHOST:PORT  : 127.0.0.1:20016
MTU         : 1500

PC3> ping 192.168.1.100

84 bytes from 192.168.1.100 icmp_seq=1 ttl=255 time=14.022 ms
84 bytes from 192.168.1.100 icmp_seq=2 ttl=255 time=3.325 ms
84 bytes from 192.168.1.100 icmp_seq=3 ttl=255 time=18.893 ms
84 bytes from 192.168.1.100 icmp_seq=4 ttl=255 time=7.298 ms
84 bytes from 192.168.1.100 icmp_seq=5 ttl=255 time=9.276 ms

PC3> ping 192.168.1.100

84 bytes from 192.168.1.100 icmp_seq=1 ttl=255 time=8.543 ms
84 bytes from 192.168.1.100 icmp_seq=2 ttl=255 time=5.330 ms
84 bytes from 192.168.1.100 icmp_seq=3 ttl=255 time=16.698 ms
84 bytes from 192.168.1.100 icmp_seq=4 ttl=255 time=3.080 ms
84 bytes from 192.168.1.100 icmp_seq=5 ttl=255 time=2.908 ms

PC3>
--------------------------------------------------------------------------------------------------------------------------------------------

PC4
--------

PC4> ip 192.168.1.4/24 192.168.1.100
Checking for duplicate address...
PC4 : 192.168.1.4 255.255.255.0 gateway 192.168.1.100

PC4> sh ip

NAME        : PC4[1]
IP/MASK     : 192.168.1.4/24
GATEWAY     : 192.168.1.100
DNS         :
MAC         : 00:50:79:66:68:01
LPORT       : 20017
RHOST:PORT  : 127.0.0.1:20018
MTU         : 1500

PC4> ping 192.168.1.100

84 bytes from 192.168.1.100 icmp_seq=1 ttl=255 time=15.597 ms
84 bytes from 192.168.1.100 icmp_seq=2 ttl=255 time=3.314 ms
84 bytes from 192.168.1.100 icmp_seq=3 ttl=255 time=5.084 ms
84 bytes from 192.168.1.100 icmp_seq=4 ttl=255 time=8.468 ms
84 bytes from 192.168.1.100 icmp_seq=5 ttl=255 time=17.343 ms

PC4> ping 192.168.1.100

84 bytes from 192.168.1.100 icmp_seq=1 ttl=255 time=19.084 ms
84 bytes from 192.168.1.100 icmp_seq=2 ttl=255 time=5.209 ms
84 bytes from 192.168.1.100 icmp_seq=3 ttl=255 time=17.372 ms
84 bytes from 192.168.1.100 icmp_seq=4 ttl=255 time=7.201 ms
84 bytes from 192.168.1.100 icmp_seq=5 ttl=255 time=3.813 ms

PC4>
--------------------------------------------------------------------------------------------------------------------------------------------

PC5
-----

PC5> 192.168.1.5/24 192.168.1.100
Bad command: "192.168.1.5/24 192.168.1.100". Use ? for help.

PC5> ip 192.168.1.5/24 192.168.1.100
Checking for duplicate address...
PC5 : 192.168.1.5 255.255.255.0 gateway 192.168.1.100

PC5> sh ip

NAME        : PC5[1]
IP/MASK     : 192.168.1.5/24
GATEWAY     : 192.168.1.100
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 20019
RHOST:PORT  : 127.0.0.1:20020
MTU         : 1500

PC5> ping 192.168.1.100

84 bytes from 192.168.1.100 icmp_seq=1 ttl=255 time=14.935 ms
84 bytes from 192.168.1.100 icmp_seq=2 ttl=255 time=5.118 ms
84 bytes from 192.168.1.100 icmp_seq=3 ttl=255 time=16.482 ms
84 bytes from 192.168.1.100 icmp_seq=4 ttl=255 time=16.682 ms
84 bytes from 192.168.1.100 icmp_seq=5 ttl=255 time=4.728 ms

PC5> ping 192.168.1.100

84 bytes from 192.168.1.100 icmp_seq=1 ttl=255 time=10.682 ms
84 bytes from 192.168.1.100 icmp_seq=2 ttl=255 time=4.563 ms
84 bytes from 192.168.1.100 icmp_seq=3 ttl=255 time=16.887 ms
84 bytes from 192.168.1.100 icmp_seq=4 ttl=255 time=18.107 ms
84 bytes from 192.168.1.100 icmp_seq=5 ttl=255 time=5.754 ms

PC5>
--------------------------------------------------------------------------------------------------------------------------------------------

ROUTER 1
------------

R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#
R1(config)#
R1(config)#int f0/0
R1(config-if)#ip add 192.168.1.100 255.255.255.0
R1(config-if)#no sh
R1(config-if)#ex
R1(config)#
*Aug 24 20:00:04.375: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state t                                         o up
*Aug 24 20:00:05.375: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                                         et0/0, changed state to up
R1(config)#
R1(config)#
R1(config)#vtp mode tr
R1(config)#do sh vtp status
                   ^
% Invalid input detected at '^' marker.

R1(config)#do ping 192b
R1(config)#do ping 192.168.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R1(config)#do ping 192.168.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R1(config)#
*Aug 24 20:37:19.715: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state t                                         o down
*Aug 24 20:37:20.715: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                                         et0/0, changed state to down
R1(config)#
*Aug 24 20:38:38.715: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state t                                         o up
R1(config)#
*Aug 24 20:38:39.715: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                                         et0/0, changed state to up
R1(config)#
*Aug 24 21:17:58.719: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state t                                         o down
*Aug 24 21:17:59.719: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                                         et0/0, changed state to down
R1(config)#
*Aug 24 21:20:05.715: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state t                                         o up
R1(config)#
*Aug 24 21:20:06.715: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                                         et0/0, changed state to up
R1(config)#do sh ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            192.168.1.100   YES manual up                    up
R1(config)#
*Aug 24 21:34:18.719: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to down
*Aug 24 21:34:19.719: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to down
R1(config)#
*Aug 24 21:35:17.111: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Aug 24 21:35:18.111: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R1(config)#
R1(config)#
R1(config)#
R1(config)#
R1(config)#do ping 192.168.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 12/19/28 ms
R1(config)#do ping 192.168.1.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/14/24 ms
R1(config)#do ping 192.168.1.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/14/20 ms
R1(config)#do ping 192.168.1.5
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.5, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/13/20 ms
R1(config)#do ping 192.168.1.4
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.4, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/17/20 ms
R1(config)#do ping 192.168.1.5
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.5, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/15/28 ms
R1(config)#do ping 192.168.1.5
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.5, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 12/20/36 ms
R1(config)#do ping 192.168.1.5
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.5, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/15/28 ms
R1(config)#do ping 192.168.1.5
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.5, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/14/24 ms
R1(config)#do ping 192.168.1.5
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.5, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/14/24 ms
R1(config)#do ping 192.168.1.5
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.5, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/14/20 ms
R1(config)#



